Revit 2024 API
BuiltInFailures.GeneralFailures.InvalidOrderOfPhases Property
 Invalid order of phases: [Type Name] cannot be demolished before it was created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidOrderOfPhases { get; }
Visual Basic
Public Shared ReadOnly Property InvalidOrderOfPhases As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidOrderOfPhases {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace